ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_pke_regs.xml
<module id="HSM_PKE" HW_revision="" description="HSM PKE Registers">
	<register id="PKE_RESET_CTRL" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="PKEFLUSH" description="" begin="20" end="20" width="1" rwaccess="RW"/>
	</register>
	<register id="PKE_IFC_ISR" width="32" page="0" offset="24" internal="0" description="">
		<bitfield id="RAMINITANDFLUSHONRESETTOIDLEINT" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MCGERRORINT" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MAUDONEERRORINT" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FIFOEMPTYINT" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FIFOERRORINT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MAUCOMMANDDONEINT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRANSITIONTOIDLEINT" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PKE_IFC_ICR" width="32" page="0" offset="28" internal="0" description="">
		<bitfield id="RAMINITANDFLUSHONRESETTOIDLEINTEN" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MCGERRORINTEN" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MAUDONEERRORINTEN" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FIFOEMPTYINTEN" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FIFOERRORINTEN" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MAUCOMMANDDONEINTEN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRANSITIONTOIDLEINTEN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PKE_STATUS" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="MAUCOMPARERESULT" description="" begin="31" end="30" width="2" rwaccess="R"/>
		<bitfield id="MCGERRORCAUSE" description="" begin="27" end="24" width="4" rwaccess="R"/>
		<bitfield id="MAUERRORCAUSE" description="" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="MAUCMDGENSTATUS" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="MAUCORESTATUSSTATE" description="" begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="FIFOSTATUS" description="" begin="3" end="0" width="4" rwaccess="R"/>
	</register>
	<register id="PKE_SCRATCH" width="32" page="0" offset="48" internal="0" description="">
		<bitfield id="MAUIFCSCRATCH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MAU_MIN_LEN" width="32" page="0" offset="52" internal="0" description="">
		<bitfield id="MAUMINLEN" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MAU_MAX_LEN" width="32" page="0" offset="56" internal="0" description="">
		<bitfield id="MAUMAXLEN" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_VERSION" width="32" page="0" offset="60" internal="0" description="">
		<bitfield id="PKEVERSION" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCG_COMMANDS_ENABLED_0" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="MCGCOMMANDSENABLED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCG_COMMANDS_ENABLED_1" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="MCGCOMMANDSENABLED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCG_COMMANDS_ENABLED_2" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="MCGCOMMANDSENABLED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCG_COMMANDS_ENABLED_3" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="MCGCOMMANDSENABLED" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_PRNG_SEED_0" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="PKEPRNGSEED_0" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PKE_PRNG_SEED_1" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="PKEPRNGSEED_1" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PKE_PRNG_SEED_2" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="PKEPRNGSEED_2" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PKE_PRNG_SEED_3" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="PKEPRNGSEED_3" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PKE_WORD_SIZE" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="PKEWORDSIZE" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_CURVES_IN_ROM_0" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="PKECURVESINROM" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_CURVES_IN_ROM_1" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="PKECURVESINROM" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_SPECIAL_PRIMES" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="PKESPECIALPRIMES" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_SRAM_ADDR_MIN" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="PKESRAMADDRMIN" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PKE_SRAM_ADDR_MAX" width="32" page="0" offset="116" internal="0" description="">
		<bitfield id="PKESRAMADDRMAX" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MAU_COMMAND" width="32" page="0" offset="128" internal="0" description="">
		<bitfield id="MAUCOMMAND" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MAU_MCG_COMMAND" width="32" page="0" offset="136" internal="0" description="">
		<bitfield id="MAUCOMMANDCMDGEN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CONTEXT_MEM" width="32" page="0" offset="8192" instances="1024" instaddr="4" internal="0" description="">
		<bitfield id="CONTEXT_WORD" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
